
## :white_check_mark: Apply Succeeded

[CI link](https://github.com/paaaaay5/terraform-ecs/actions/runs/5796841011)



<pre><code>Apply complete! Resources: 4 added, 0 changed, 0 destroyed.</code></pre>

<details><summary>Details (Click me)</summary>

```hcl
Acquiring state lock. This may take a few moments...
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-0157a5649b2123617]
module.vpc.aws_default_network_acl.this[0]: Refreshing state... [id=acl-0914e5fb0f3aa1053]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-01a7e3a43a003a4cc]
aws_security_group.alb: Refreshing state... [id=sg-05d7e6d822fc58988]
module.vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-0511538431383fdaa]
aws_security_group.ecs: Refreshing state... [id=sg-0be6476e5b23a7d6e]
module.vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-01996f1e56d9e5a2f]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-030e23fff230102c4]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-0a6c2bd59bf6d02c2]
module.vpc.aws_route_table.private[1]: Refreshing state... [id=rtb-0312b53d701b3a36f]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-05d9cce52017c998c]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-07129185ac01a5f47]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-006145e36e39b1c48]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-00a08173e1848e10b]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-05c59bea5a5eec2be]
aws_security_group_rule.ecs_from_alb: Refreshing state... [id=sgrule-1827683724]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-01476c50ae92d1684]
module.vpc.aws_eip.nat[1]: Refreshing state... [id=eipalloc-0b29f0f2fe8209f16]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-01a7e3a43a003a4cc1080289494]
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-02d9323927f7034ce]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-01c0e92fa222a8113]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-01aaf207c05919842]
module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-0e68ab255b3ad7791]
module.vpc.aws_nat_gateway.this[1]: Refreshing state... [id=nat-090bcbb028c1df6a1]
module.vpc.aws_route.private_nat_gateway[1]: Refreshing state... [id=r-rtb-0312b53d701b3a36f1080289494]
module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-030e23fff230102c41080289494]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_lb.alb will be created
  + resource "aws_lb" "alb" {
      + arn                                         = (known after apply)
      + arn_suffix                                  = (known after apply)
      + desync_mitigation_mode                      = "defensive"
      + dns_name                                    = (known after apply)
      + drop_invalid_header_fields                  = false
      + enable_deletion_protection                  = false
      + enable_http2                                = true
      + enable_tls_version_and_cipher_suite_headers = false
      + enable_waf_fail_open                        = false
      + enable_xff_client_port                      = false
      + id                                          = (known after apply)
      + idle_timeout                                = 60
      + internal                                    = (known after apply)
      + ip_address_type                             = (known after apply)
      + load_balancer_type                          = "application"
      + name                                        = "go-simple-server-alb"
      + preserve_host_header                        = false
      + security_groups                             = [
          + "sg-05d7e6d822fc58988",
        ]
      + subnets                                     = [
          + "subnet-05d9cce52017c998c",
          + "subnet-0a6c2bd59bf6d02c2",
        ]
      + tags_all                                    = (known after apply)
      + vpc_id                                      = (known after apply)
      + xff_header_processing_mode                  = "append"
      + zone_id                                     = (known after apply)
    }

  # aws_lb_listener.alb_listener will be created
  + resource "aws_lb_listener" "alb_listener" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + load_balancer_arn = (known after apply)
      + port              = 80
      + protocol          = "HTTP"
      + ssl_policy        = (known after apply)
      + tags_all          = (known after apply)

      + default_action {
          + order = (known after apply)
          + type  = "fixed-response"

          + fixed_response {
              + content_type = "text/plain"
              + message_body = "Fixed response content"
              + status_code  = "200"
            }
        }
    }

  # aws_lb_listener_rule.alb_listener_rule will be created
  + resource "aws_lb_listener_rule" "alb_listener_rule" {
      + arn          = (known after apply)
      + id           = (known after apply)
      + listener_arn = (known after apply)
      + priority     = (known after apply)
      + tags_all     = (known after apply)

      + action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }

      + condition {
          + path_pattern {
              + values = [
                  + "*",
                ]
            }
        }
    }

  # aws_lb_target_group.target_group will be created
  + resource "aws_lb_target_group" "target_group" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = false
      + deregistration_delay               = "300"
      + id                                 = (known after apply)
      + ip_address_type                    = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancing_algorithm_type      = (known after apply)
      + load_balancing_cross_zone_enabled  = (known after apply)
      + name                               = "go-simple-server-target-group"
      + port                               = 8080
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags_all                           = (known after apply)
      + target_type                        = "ip"
      + vpc_id                             = "vpc-0157a5649b2123617"

      + health_check {
          + enabled             = true
          + healthy_threshold   = 3
          + interval            = 30
          + matcher             = (known after apply)
          + path                = "/health_checks"
          + port                = "traffic-port"
          + protocol            = "HTTP"
          + timeout             = 5
          + unhealthy_threshold = 3
        }
    }

Plan: 4 to add, 0 to change, 0 to destroy.
aws_lb.alb: Creating...
aws_lb_target_group.target_group: Creating...
aws_lb_target_group.target_group: Creation complete after 3s [id=arn:aws:elasticloadbalancing:ap-northeast-1:774848854882:targetgroup/go-simple-server-target-group/b3cb53bb1152686b]
aws_lb.alb: Still creating... [10s elapsed]
aws_lb.alb: Still creating... [20s elapsed]
aws_lb.alb: Still creating... [30s elapsed]
aws_lb.alb: Still creating... [40s elapsed]
aws_lb.alb: Still creating... [50s elapsed]
aws_lb.alb: Still creating... [1m0s elapsed]
aws_lb.alb: Still creating... [1m10s elapsed]
aws_lb.alb: Still creating... [1m20s elapsed]
aws_lb.alb: Still creating... [1m30s elapsed]
aws_lb.alb: Still creating... [1m40s elapsed]
aws_lb.alb: Still creating... [1m50s elapsed]
aws_lb.alb: Still creating... [2m0s elapsed]
aws_lb.alb: Still creating... [2m10s elapsed]
aws_lb.alb: Creation complete after 2m15s [id=arn:aws:elasticloadbalancing:ap-northeast-1:774848854882:loadbalancer/app/go-simple-server-alb/87b30ac73477fbbb]
aws_lb_listener.alb_listener: Creating...
aws_lb_listener.alb_listener: Creation complete after 0s [id=arn:aws:elasticloadbalancing:ap-northeast-1:774848854882:listener/app/go-simple-server-alb/87b30ac73477fbbb/2f7bf68d670bd9e8]
aws_lb_listener_rule.alb_listener_rule: Creating...
aws_lb_listener_rule.alb_listener_rule: Creation complete after 1s [id=arn:aws:elasticloadbalancing:ap-northeast-1:774848854882:listener-rule/app/go-simple-server-alb/87b30ac73477fbbb/2f7bf68d670bd9e8/8183a7fd3246820b]
Releasing state lock. This may take a few moments...

Apply complete! Resources: 4 added, 0 changed, 0 destroyed.

```

</details>

<!-- github-comment: {"Command":"apply","JobName":"terraform","PRNumber":4,"Program":"tfcmt","SHA1":"091c221129dadee24f0f83f049c195f7a8ca2338","Vars":{},"WorkflowName":"Terraform-CICD"} -->